1=Erro desconhecido.
1062=Este \u00EDtem j\u00E1 est\u00E1 cadastrado no banco.
2=O ID do item selecionado deve ser informado.
3=O campo NOME deve ser informado.
6=O campo MATR\u00CDCULA deve ser informado.
8=O campo SENHA deve ser informado.
9=O campo PAPEL deve ser informado.
12=O campo DESCRI\u00C7\u00C3O deve ser informado.
10=A matr\u00EDcula informada n\u00E3o existe.
11=O Status solicitado n\u00E3o existe.
14=O campo CAPACIDADE deve ser informado.
15=O campo TIPO DE SALA deve ser informado.
16=O campo PR\u00C9DIO deve ser informado.
17=O campo TIPO DE QUADRO deve ser informado.
18=O campo CONEX\u00C3O COM INTERNET deve ser informado.
20=O campo PERFIL DE TURMA deve ser informado.
21=TURMA n\u00E3o encontrada.
22=O campo LOCAL deve ser informado.
23=LOCAL INV\u00C1LIDO \! Verifique a consist\u00EAncia entre os campos LOCAL e DISTRIBUIR.
24=Essa opera\u00E7\u00E3o s\u00F3 pode ser executada uma \u00FAnica vez.
25=Ainda n\u00E3o foi realizada a distribui\u00E7\u00E3o das turmas.
26=Hor\u00E1rios das turmas n\u00E3o s\u00E3o equivalentes.
27=As turmas tem perfis diferentes.
28=Selecione turmas diferentes.
29=O campo Departamento deve ser informado.
30=Selecione uma turma.
31=Selecione uma sala.
32=A turma n\u00E3o p\u00F4de ser alocada na sala. Verifique e repita a opera\u00E7\u00E3o novamente.
33=Turma com hor\u00E1rio inv\u00E1lido.
34=Campo 'Hor\u00E1rio' VAZIO ou INV\u00C1LIDO.
35=O campo TURNO deve ser informado.
36=INTERESSADO do agendamento n\u00E3o foi informado.
37=TELEFONE do interessado n\u00E3o foi informado.
38=MOTIVO do agendamento n\u00E3o foi informado.
39=DATA(s) ou PER\u00CDODO do agendamento n\u00E3o foi informado.
40=Existe uma turma neste hor\u00E1rio da sala.
41=O campo C\u00D3DIGO DA DISCIPLINA deve ser informado.
42=O campo DISCIPLINA deve ser informado.
43=O campo HOR\u00C1RIO deve ser informado.
44=O campo N\u00DAMERO deve ser informado.
45=O campo DOCENTE deve ser informado.
46=O hor\u00E1rio na data informada n\u00E3o est\u00E1 dispon\u00EDvel.
47=A(S) DATA(S) DE AGENDAMENTO deve(m) ser igual(is) ou posterior(es) a DATA ATUAL.
48=DATA DE AGENDAMENTO n\u00E3o corresponde ao DIA DA SEMANA.
51=O campo MATR\u00CDCULA/CPF deve ser informado.
55=O campo OPERA\u00C7\u00C3O deve ser informado.
56=O campo C\u00D3DIGO DA CHAVE deve ser informado.
57=C\u00D3DIGO DE CHAVE n\u00E3o encontrado.
58=ENTRADA J\u00C1 REGISTRADA \!
59=SA\u00CDDA J\u00C1 REGISTRADA \!
60=A primeira opera\u00E7\u00E3o da CHAVE deve ser uma SA\u00CDDA.
63=TURMA ainda sem SALA definida.
66=O campo LOGIN deve ser informado.
67=SENHAS n\u00E3o coincidem.
68=O campo INTERESSADO deve ser informado.
69=J\u00E1 existe um USU\u00C1RIO vinculado ao FUNCION\u00C1RIO.
70=J\u00E1 existe um USU\u00C1RIO com o login informado.
71=O campo EMAIL deve ser informado.
72=O EMAIL informado \u00E9 INV\u00C1LIDO.
73=O FUNCION\u00C1RIO n\u00E3o pode ser exclu\u00EDdo, pois existe um USU\u00C1RIO vinculado.
74=O campo PERFIL DO INTERESSADO deve ser informado.
76=O campo DATA INICIAL deve ser informado.
77=O campo DATA FINAL deve ser informado.
78=A DATA FINAL deve ser posterior a DATA INICIAL.
80=Campo 'Hor\u00E1rio Opcional' INV\u00C1LIDO.
83=O campo PER\u00CDODO deve ser informado.
84=N\u00C3O foi poss\u00EDvel a EXCLUS\u00C3O. A SALA tem TURMA alocada.
85=Informe se \u00E9 um PER\u00CDODO LETIVO.
86=Existe(m) TURMA(S) vinculada(s) ao PER\u00CDODO.
87=O campo DATA deve ser informado.
88=PER\u00CDODO e DATA informados. Apenas UM deles deve ser informado.
89=Data Inicial do PER\u00CDODO inv\u00E1lida.
90=Data Final do PER\u00CDODO inv\u00E1lida.
91=Hor\u00E1rios informados no mesmo turno. Os TURNOS devem ser DISTINTOS.
92=J\u00E1 existe um PER\u00CDODO contemplando o intervalo de datas informado.
93=Data Final deve ser posterior a Data Inicial.
94=MATR\u00CDCULA e CPF vazios. Pelo menos UM DELES deve ser informado.
95=DATAS n\u00E3o correspondem ao PER\u00CDODO informado.
96=FERIADO n\u00E3o corresponde ao PER\u00CDODO informado.
97=DIAS DA SEMANA do PER\u00CDODO devem ser informados.
98=Opera\u00E7\u00E3o n\u00E3o permitida, pois a turma est\u00E1 ALOCADA numa sala. Primeiro DESALOQUE-A.
99=HOR\u00C1RIO n\u00E3o pode ser alterado. Turma est\u00E1 ALOCADA numa sala. Primeiro DESALOQUE-A.
100=O campo ANO deve ser informado.
101=O campo N\u00DAMERO DO PER\u00CDODO deve ser informado.
102=O campo RESPONS\u00C1VEL deve ser informado.
103=DDD do telefone do interessado n\u00E3o foi informado..